<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Порядок возрата");
?><div class="container">
<p>
	 При оплате картами возврат наличными денежными средствами не допускается. Порядок возврата регулируется правилами международных платежных систем.
</p>
<p>
 <b>1. Основные понятия</b>
</p>
<p>
	 Понятия и определения, использующиеся в настоящих Правилах оказания услуг по приготовлению и доставке блюд (далее – «Правила»), употребляются в следующих значениях:<br>
	 «Исполнитель» – организация, непосредственно или через привлеченных лиц оказывающая услуги по приготовлению готовых блюд и их доставке по заказам Клиентов.<br>
	 «Клиент» – лицо, кому оказываются услуги по приготовлению и доставке блюд для собственного потребления.<br>
	 «Получатель Заказа» – лицо, получающее приготовленную и доставленную по заказу Клиента продукцию.<br>
	 «Сайт» – совокупность компьютерных программ, обеспечивающих публикацию данных, касающихся услуг, продукции Исполнителя путем сообщения их для всеобщего сведения посредством технических средств связи в сети Интернет по адресу <a href="http://www.ddpizza.ru">www.ddpizza.ru</a>.<br>
	 «Услуга» – совокупность действий Исполнителя по приготовлению, упаковке, доставке или подачи Продукции, заказанной Клиентом.<br>
	 «Продукция» – блюда и сопутствующие товары, указанные на Сайте Исполнителя и доступные для заказа Клиентом.<br>
	 «Ресторан» - фактическое место осуществления процессов, связанных с производством, упаковкой, комплектации и подготовкой продукции.<br>
	 «Заказ» – совокупность действий Клиента по выражению намерения получить от Исполнителя услугу по приготовлению и доставке готовых блюд и сопутствующих товаров, заказанные для приготовления и доставки. Под Заказом понимается также комплект блюд и сопутствующих товаров, заказанных Клиентом.
</p>
<p>
 <b>2. Отказ от услуг (Возврат товара надлежащего качества)</b>
</p>
<p>
	 2.1. В соответствии с законодательством РФ возврат продовольственной Продукции надлежащего качества не допускается, возврат денежных средств за такую Продукцию не производится.
</p>
<p>
 <b>3. Возврат Продукции ненадлежащего качества</b>
</p>
<p>
	 3.1. В случае если Клиент обнаружит, что ему передана Продукция ненадлежащего качества, он вправе до истечения срока годности возвратить Продукцию ненадлежащего качества Исполнителю и потребовать возврата уплаченной денежной суммы, либо потребовать замены Продукции ненадлежащего качества.<br>
	 При этом стоимость Продукции возвращается Клиенту в течение 10 дней с момента получения Исполнителем заявления Клиента.<br>
	 3.2. Порядок действий при пересортице.<br>
	 В случае обнаружения в Заказе Продукции, не соответствующей заказанной, Клиент вправе принять данную Продукцию или отказаться от нее и потребовать замены на Продукцию, предусмотренную Заказом, либо возврата денежных средств за фактически неполученную Продукцию.<br>
	 3.3. Замена Продукции, не соответствующей Заказу по ассортименту, осуществляется путем оформления нового заказа.<br>
	 3.4. Порядок действий при доставке не полностью скомплектованного заказа.<br>
	 При доставке меньшего количества Продукции, чем определено Заказом, Клиент вправе принять Продукцию в части, соответствующей Заказу, и потребовать передать недостающее количество Продукции либо, если недостающая Продукция была оплачена, отказаться от Заказа в части недостающей Продукции и потребовать возврата денежных средств за недостающую Продукцию. Данный факт недовложения Продукции оформляется Актом в произвольной форме, который подписывается Клиентом/Получателем и курьером.<br>
	 Доставка недостающей Продукции осуществляется посредством оформления нового Заказа.
</p>
<p>
 <b>4. Процедура возврата денежных средств:</b>
</p>
<p>
	 4.1 Обратитесь в колл центр по номеру телефона +7 (925) 535 98 48
</p>
<p>
	 или напишите письмо на адрес <a href="mailto:info@ddpizza.ru">info@ddpizza.ru</a> c указанием номера заказа, возвращаемого товара и причины возврата.<br>
	 2) Согласуйте с менеджером, как Вы будете возвращать товар ненадлежащего качества - через курьера или через пункт самовывоза.<br>
	 3) Возврат денежных средств происходит после возврата товара ненадлежащего качества в Ресторан. Если Вы оплачивали заказ на сайте онлайн, деньги вернутся на карту. Если оплачивали курьеру или в пункте выдачи, менеджер запросит у Вас реквизиты для перечисления средств.<br>
	 Возврат денежных средств по ошибочным операциям<br>
	 Для возврата денежных средств по операциям проведенными с ошибками необходимо обратиться с письменным заявлением и приложением копии паспорта и чеков/квитанций, подтверждающих ошибочное списание. Данное заявление необходимо направить по адресу <a href="mailto:info@ddpizza.ru">info@ddpizza.ru</a>.
</p>
<p>
	 &nbsp;
</p>
</div><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>