<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Оплата");
?><div class="bx_page">
	<h2>Оплата и цены</h2>
	<p>
		 Цены, указанные на сайте, являются окончательными и не требуют доплат при стандартных условиях поставки. Все налоги включены в стоимость товара.
	</p>
	<p>
 <b>Внимание!</b> Для каждого отдельного заказа возможен только один способ оплаты на ваш выбор. Оплата заказа по частям различными способами невозможна.
	</p>
	<p>
		 Возможные способы оплаты:
	</p>
	<ul>
		<li><b>Наличный расчет</b>. <br>
		 Оплата производится наличными курьеру при доставке или в магазине при самовывозе. Вместе с товаром передается товарный и кассовый чеки, а также гарантийный талон.</li>
		<li><b>Наложенный платеж</b>. <br>
		 Вы можете оплатить посылку при получении в почтовом отделении.</li>
		<li><b>Банковская карта</b>.<br>
		 Оплата с помощью банковской карты на сайте.</li>
		<li><b>Оплата через Сбербанк</b>. <br>
		 Вы можете оплатить заказ в любом отделении Сбербанка. За услугу по переводу денег с вас возьмут от 3 до 7% от стоимости заказа, в зависимости от региона. Перечисление денег займет порядка 10 дней.</li>
		<li><b>Альфа-Банк: интернет-эквайринг</b>. <br>
		 Оплата производится с помощью банковской карты Альфа-банк прямо на сайте.</li>
		<li><b>Web Money</b>.<br>
		 Вы можете оплатить товар с помощью платежной системы Web Money.</li>
		<li><b>Яндекс.Деньги</b>.<br>
		 Вы можете оплатить товар с помощью платежной системы Яндекс.Деньги</li>
		<li><b>Терминалы</b>.<br>
		 Оплата производится через платежные терминалы.</li>
	</ul>
</div>
 <br><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>

