<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Оплата");
?><div class="bx_page">
	<h2>Оплата и цены</h2>
	<p>
		 Цены, указанные на сайте, являются окончательными и не требуют доплат при стандартных условиях поставки. Все налоги включены в стоимость товара.
	</p>
	<p>
 <b>Внимание!</b> Для каждого отдельного заказа возможен только один способ оплаты на ваш выбор. Оплата заказа по частям различными способами невозможна.
	</p>
	<p>
		 Возможные способы оплаты:
	</p>
	<ul>
		<li><b>Наличный расчет</b>. <br>
		 Оплата производится наличными курьеру при доставке или в магазине при самовывозе. Вместе с товаром передается товарный и кассовый чеки, а также гарантийный талон.</li>
		<li><b>Банковская карта</b>.<br>
		 Оплата с помощью банковской карты курьеру при получении.</li>
		
	</ul>
</div>
 <br><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>