<? require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/header.php");
$APPLICATION->SetTitle("О нас");
?><? if (!isset($_GET["old"])) {
    $APPLICATION->SetTitle("МЫ – КАФЕ ДЛЯ ВСЕЙ СЕМЬИ");
    ?>
<div class="container">
	 <? } ?>
	<div class="bx_page">
		 <? if (!isset($_GET["new"])) {
    ?>
		<h1>МЫ – КАФЕ ДЛЯ ВСЕЙ СЕМЬИ&nbsp;</h1>
		 <? } ?>
		<p>
			 Мы любим&nbsp;готовить и хотим вкусно&nbsp;накормить вас, дать возможность пообщаться, отдохнуть,&nbsp;провести деловую встречу или свой&nbsp;праздник.&nbsp;
		</p>
		<p>
			 Главный наш хит - итальянская пицца ручной работы. Однажды в путешествии&nbsp;мы попробовали такую. И поняли - это любовь навсегда. Идея делать&nbsp;именно такую пиццу здесь, дома, пришла в тот же момент.&nbsp;С той поры&nbsp;все и началось. Мы учились всему у&nbsp;титулованного мастера из Европы, тщательно отбирали поставщиков ингредиентов, искали правильную муку, осваивали секреты приготовления&nbsp;теста и&nbsp;специальную печь. С 1 мая 2016 на Новой Риге начало свою работу наше первое кафе "Дядя Пицца".&nbsp;
		</p>
		<p>
			 Мы знаем -&nbsp;кто однажды попробовал нашу пиццу -&nbsp;всегда за ней возвращается. У нас в меню Вы найдете 27 видов пицц на любой вкус, салаты.
		</p>
 		<br>
		<p>
			 Особое внимание мы уделяем детям : обустроенная детская зона, мастер-классы, работа аниматоров – это только небольшая часть того, что мы можем Вам предложить. Наша команда рада организовать в кафе День Рождения ребенка или семейное торжество, приготовить для Вас восхитительный торт на заказ или устроить незабываемую фотосессию.&nbsp;
		</p>
		<br>
		<p>
			 Работает быстрая доставка пиццы, суши и блюд из основного&nbsp;меню.&nbsp;
		</p>
		<p>
			 Для всех гостей своя бесплатная парковка и Wi-Fi.
		</p>
		<p>
			 А еще мы очень любим устраивать&nbsp;акции, проводить конкурсы и дарить подарки. И&nbsp;первыми об этом всегда узнают наши подписчики в соцсетях.
		</p>
		<p>
			 Мы готовим с душой. И - да! - у нас действительно ВКУСНО! Потому что мы любим то, что делаем.
		</p>
	</div>
 <br>
	 <? if (!isset($_GET["old"])) {
        ?>
</div>
    <? }
?><? require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/footer.php"); ?>