<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Оплата заказов");
?><div class="container">
<h2>
Оплатить оформленный на сайте заказ можно несколькими способами:</h2>
<br />
<ul>
<li>
<p>
<strong>Банковской картой онлайн.</strong> Вы можете оплатить покупку банковской картой Visa, Mastercard, МИР. Для этого при оформлении заказа выберите способ оплаты «Интернет-эквайринг Сбербанк». Оплата производится через платежный шлюз ПАО "Сбербанк".
<br />
<br />
<br />
</p>
<p><em>
Персональные данные, которые Вы сообщаете нам через сайт, защищены шифрованием с использованием последней версии сертификата безопасности SSL. Мы обеспечиваем финансовую безопасность при совершении покупок на сайте, благодаря использованию технологии платежных систем Verified by Visa и MasterCard SecureCode, которые защищают Вас от кражи персональных данных при совершении онлайн-платежей.</em></p>
<br />
<br />

</li>
<li>
<p>
<strong>Банковской картой в ресторане или при доставке курьером;</strong>
<br />
<br />
</p>
</li>
<li>
<p>
<strong>Наличными в ресторане или при доставке курьером.</strong>
<br />
</p>
</li>
<br />
<br />
</div><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>