$(window).load(function () {
    ymaps.ready(init);
    function init() {
        var delivery_price, delivery_address, delivery_coords;
        var suggestView = new ymaps.SuggestView('deliveryAddress'), hiddenMap, placemark, deliveryZones;
        var json = {"type": "FeatureCollection",
            "features": [{
                    "type": "Feature",
                    "id": 0,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.85580885732791, 36.932694053688714],
                                [55.85262493813791, 36.942310598434126],
                                [55.850163040268896, 36.95119407469167],
                                [55.84635443947344, 36.958513823093114],
                                [55.84376636911894, 36.962244775832815],
                                [55.84205648766999, 36.963014569819904],
                                [55.84353848926842, 36.97665092045016],
                                [55.84221948031083, 36.97877522999085],
                                [55.83965377259627, 36.977211502135034],
                                [55.838772337451346, 36.97946455770742],
                                [55.83142877937184, 36.97105315023666],
                                [55.823096343537564, 36.970189478933904],
                                [55.822074103951635, 36.97361465984615],
                                [55.81885772350068, 36.97315600210433],
                                [55.81878523868652, 36.954828467905315],
                                [55.813203495295475, 36.95767160946106],
                                [55.796955080708585, 36.952645149766994],
                                [55.78407659355253, 36.96187731319579],
                                [55.78010996347928, 36.96664091640639],
                                [55.778660301260125, 36.975009408531385],
                                [55.77613573686546, 36.95897248083274],
                                [55.77105587393708, 36.942391064702385],
                                [55.78124516595486, 36.92577477985514],
                                [55.791806550822294, 36.92235228115206],
                                [55.81989478059305, 36.9172936349496],
                                [55.84804565510636, 36.92536976629341],
                                [55.85192651217424, 36.928676930008336]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#FF000040"},
                    "properties": {"name": "Зона 1", "price": zone1price}
                }, {
                    "type": "Feature",
                    "id": 1,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.85439840276594, 36.95651941081107],
                                [55.85392768000503, 36.96361653586358],
                                [55.8539895383261, 36.965072975358204],
                                [55.85414795511056, 36.96579180737456],
                                [55.85635515589964, 36.96916066189654],
                                [55.85713813170984, 36.970686838826495],
                                [55.85677908142009, 36.971555874547356],
                                [55.856566365008604, 36.972529516419605],
                                [55.855501257339704, 36.97243027468596],
                                [55.852062841331296, 36.969638095101416],
                                [55.85102175123226, 36.96831844826601],
                                [55.850249214039344, 36.96845792313487],
                                [55.84925334226946, 36.96837209244556],
                                [55.84760198224723, 36.9653465606776],
                                [55.85258582179305, 36.956524775227265]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#ffd21e40"},
                    "properties": {"name": "Зона 2", "price": "700"}
                },
                {
                    "type": "Feature",
                    "id": 2,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.84903566193218, 36.98304263785885],
                                [55.84904018861422, 36.99340401128312],
                                [55.84829477310325, 36.99904737905045],
                                [55.84438186044315, 37.02318457797567],
                                [55.84535673020797, 37.03425673678864],
                                [55.84235055119474, 37.04551128581545],
                                [55.839098121736626, 37.050738911185206],
                                [55.83774273621025, 37.04634008840094],
                                [55.823612509258936, 37.03473416999284],
                                [55.8200746167505, 37.037440518888964],
                                [55.81841352296611, 37.03963456586318],
                                [55.81511528556998, 37.0360377235741],
                                [55.81072173036727, 37.03809497788846],
                                [55.809827552937335, 37.03113196328598],
                                [55.80865979940823, 37.03227155990885],
                                [55.80299955196458, 37.0254962999398],
                                [55.796978872188284, 37.0120047885952],
                                [55.795807865883354, 37.00710707493379],
                                [55.794390523172524, 37.00438463278341],
                                [55.79307588377364, 37.00064295120773],
                                [55.789393146254255, 36.99873858280742],
                                [55.78568889915128, 36.994339760022875],
                                [55.78163815493381, 36.99567013569434],
                                [55.77844260516865, 36.990168925004475],
                                [55.778660301260125, 36.975009408531385],
                                [55.78010996347928, 36.96664091640639],
                                [55.78407659355253, 36.96187731319579],
                                [55.796955080708585, 36.952645149766994],
                                [55.813203495295475, 36.95767160946106],
                                [55.81878523868652, 36.954828467905315],
                                [55.81885772350068, 36.97315600210433],
                                [55.822074103951635, 36.97361465984615],
                                [55.823096343537564, 36.970189478933904],
                                [55.83142877937184, 36.97105315023666],
                                [55.838772337451346, 36.97946455770742],
                                [55.83965377259627, 36.977211502135034],
                                [55.84221948031083, 36.97877522999085],
                                [55.84353848926842, 36.97665092045016]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#ffd21e40"},
                    "properties": {"name": "Зона 3", "price": "700"}
                },
                {
                    "type": "Feature",
                    "id": 3,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.82753475849143, 37.10449215631041],
                                [55.829207538962585, 37.111779718204],
                                [55.840298021381415, 37.12291028035257],
                                [55.838815895203844, 37.13735665810654],
                                [55.83108135459536, 37.13845636380259],
                                [55.82986004974626, 37.13955606949851],
                                [55.829290899494005, 37.14303489459102],
                                [55.82750791006658, 37.142823000078494],
                                [55.82526433712582, 37.144697864180145],
                                [55.821530296400134, 37.14482392800359],
                                [55.80772949393832, 37.15754832757016],
                                [55.80449530497526, 37.143759091023135],
                                [55.8031054729947, 37.12707575095129],
                                [55.798826893543016, 37.12827201617131],
                                [55.79305592885957, 37.10097624761895],
                                [55.79049500099976, 37.093879122564864],
                                [55.78869511402718, 37.080779213737536],
                                [55.79890697078773, 37.070887226890676],
                                [55.79944635045645, 37.08203448755658],
                                [55.80110372496684, 37.08575739366923],
                                [55.805720430817836, 37.08525582058283],
                                [55.809490736171924, 37.088206250499994],
                                [55.81115674373018, 37.096145589184125],
                                [55.81062658949416, 37.10820480091507],
                                [55.81549739157182, 37.11303009493279],
                                [55.81711934599549, 37.09518267614775],
                                [55.81864156563158, 37.09711118442954],
                                [55.82028301925322, 37.10144563419764],
                                [55.823013084076834, 37.103722829651446],
                                [55.824895931529944, 37.101657528710064],
                                [55.82501823051033, 37.097838063073006]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#ffd21e40"},
                    "properties": {"name": "Зона 3", "price": "700"}
                }, {
                    "type": "Feature",
                    "id": 4,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.838025002257474, 37.06601365311107],
                                [55.83186484143818, 37.06041051847932],
                                [55.82447316718779, 37.07613362772454],
                                [55.82550591224574, 37.08013280136551],
                                [55.82210107063739, 37.0909045527693],
                                [55.82501823051033, 37.097838063073006],
                                [55.824895931529944, 37.101657528710064],
                                [55.823013084076834, 37.103722829651446],
                                [55.82028301925322, 37.10144563419764],
                                [55.81864156563158, 37.09711118442954],
                                [55.81711934599549, 37.09518267614775],
                                [55.81549739157182, 37.11303009493279],
                                [55.81062658949416, 37.10820480091507],
                                [55.81115674373018, 37.096145589184125],
                                [55.809490736171924, 37.088206250499994],
                                [55.805720430817836, 37.08525582058283],
                                [55.80110372496684, 37.08575739366923],
                                [55.79944635045645, 37.08203448755658],
                                [55.79890697078773, 37.070887226890676],
                                [55.78869511402718, 37.080779213737536],
                                [55.79049500099976, 37.093879122564864],
                                [55.79305592885957, 37.10097624761895],
                                [55.7904340717218, 37.1233351419671],
                                [55.78936714422618, 37.12527974350284],
                                [55.78771531331451, 37.122291762660254],
                                [55.78483464204967, 37.102293212245094],
                                [55.784464340854136, 37.09215714437778],
                                [55.77669173510458, 37.09073289139071],
                                [55.77409447311122, 37.084703285525165],
                                [55.774236586178056, 37.06121518118155],
                                [55.763612951816185, 37.03333630068058],
                                [55.77844260516865, 36.990168925004475],
                                [55.78163815493381, 36.99567013569434],
                                [55.78568889915128, 36.994339760022875],
                                [55.789393146254255, 36.99873858280742],
                                [55.79307588377364, 37.00064295120773],
                                [55.794390523172524, 37.00438463278341],
                                [55.795807865883354, 37.00710707493379],
                                [55.796978872188284, 37.0120047885952],
                                [55.80299955196458, 37.0254962999398],
                                [55.80865979940823, 37.03227155990885],
                                [55.809827552937335, 37.03113196328598],
                                [55.81072173036727, 37.03809497788846],
                                [55.81511528556998, 37.0360377235741],
                                [55.81841352296611, 37.03963456586318],
                                [55.8200746167505, 37.037440518888964],
                                [55.823612509258936, 37.03473416999284],
                                [55.83774273621025, 37.04634008840094],
                                [55.839098121736626, 37.050738911185206]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#00FF0040"},
                    "properties": {"name": "Зона 4", "price": "500"}
                }, {
                    "type": "Feature",
                    "id": 5,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.79305592885957, 37.10097624761895],
                                [55.7904340717218, 37.1233351419671],
                                [55.78936714422618, 37.12527974350284],
                                [55.78771531331451, 37.122291762660254],
                                [55.77124653573829, 37.14028026593134],
                                [55.768989120655135, 37.160445113305414],
                                [55.791499940545506, 37.175427932862625],
                                [55.79815303565249, 37.171412665967374],
                                [55.82726936640207, 37.17989649308154],
                                [55.83738201193054, 37.17584099305086],
                                [55.84115678324845, 37.163725454931],
                                [55.844309438765876, 37.146221358899844],
                                [55.845041349367705, 37.13801648152333],
                                [55.84845624611433, 37.134239931230354],
                                [55.848432102987246, 37.12313558590877],
                                [55.84213928040347, 37.11995716822624],
                                [55.840298021381415, 37.12291028035257],
                                [55.838815895203844, 37.13735665810654],
                                [55.83108135459536, 37.13845636380259],
                                [55.82986004974626, 37.13955606949851],
                                [55.829290899494005, 37.14303489459102],
                                [55.82750791006658, 37.142823000078494],
                                [55.82526433712582, 37.144697864180145],
                                [55.821530296400134, 37.14482392800359],
                                [55.80772949393832, 37.15754832757016],
                                [55.80449530497526, 37.143759091023135],
                                [55.8031054729947, 37.12707575095129],
                                [55.798826893543016, 37.12827201617131]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#f371d040"},
                    "properties": {"name": "Зона 5", "price": "1000"}
                },
                {
                    "type": "Feature",
                    "id": 6,
                    "geometry": {
                        "type": "Polygon",
                        "coordinates": [[
                                [55.85229901569957, 37.15827849368734],
                                [55.85124586141367, 37.161711721226474],
                                [55.85268677464859, 37.17396941642445],
                                [55.851096486099365, 37.182123331829665],
                                [55.84706917287397, 37.191170422836755],
                                [55.845893643493625, 37.19598230580941],
                                [55.833819388885765, 37.19279047708159],
                                [55.82105280774281, 37.19908562163946],
                                [55.81374515703584, 37.19026115398039],
                                [55.791499940545506, 37.175427932862625],
                                [55.79815303565249, 37.171412665967374],
                                [55.82726936640207, 37.17989649308154],
                                [55.83738201193054, 37.17584099305086],
                                [55.84115678324845, 37.163725454931],
                                [55.844309438765876, 37.146221358899844]
                            ]]
                    },
                    "options": {"strokeColor": "#FFFFFF", "fillColor": "#b51eff40"},
                    "properties": {"name": "Зона 6", "price": "2000"}
                }

            ]};

        // При клике по кнопке запускаем верификацию введёных данных.
        $('#deliveryAddress').bind('keyup', function (e) {
            var val = $(this).val();
            if (val.length > 3) {
                geocode();
            }
        });
        function geocode() {
            // Забираем запрос из поля ввода.
            var request = $('#deliveryAddress').val();
            // Геокодируем введённые данные.
            ymaps.geocode(request).then(function (res) {
                var obj = res.geoObjects.get(0),
                        error, hint;

                if (obj) {
                    // Об оценке точности ответа геокодера можно прочитать тут: https://tech.yandex.ru/maps/doc/geocoder/desc/reference/precision-docpage/
                    switch (obj.properties.get('metaDataProperty.GeocoderMetaData.precision')) {
                        case 'exact':
                            break;
                        case 'number':
                        case 'near':
                        case 'range':
                            error = 'Неточный адрес';
                            hint = 'Уточните номер дома';
                            break;
                        case 'street':
                            error = 'Неточный адрес';
                            hint = 'Уточните номер дома';
                            break;
                        case 'other':
                        default:
                            error = 'Неточный адрес';
                            hint = 'Уточните адрес';
                    }
                } else {
                    error = 'Адрес не найден';
                    hint = 'Уточните адрес';
                }

                // Если геокодер возвращает пустой массив или неточный результат, то показываем ошибку.
                if (error) {
                    showError(error);
                    //showMessage(hint);
                } else {
                    showResult(obj);
                }
            }, function (e) {
                console.log(e)
            })

        }
        function showResult(obj) {
            // Удаляем сообщение об ошибке, если найденный адрес совпадает с поисковым запросом.
            $('#deliveryAddress').removeClass('input_error');
            $('#deliveryNotice').hide();
            $('#deliveryMessage').hide();

            var mapContainer = $('#hidden_map'),
                    bounds = obj.properties.get('boundedBy'),
                    // Рассчитываем видимую область для текущего положения пользователя.
                    mapState = ymaps.util.bounds.getCenterAndZoom(
                            bounds,
                            [mapContainer.width(), mapContainer.height()]
                            ),
                    // Сохраняем полный адрес для сообщения под картой.
                    address = [obj.getLocalities(), obj.getThoroughfare(), obj.getPremiseNumber()].join(', ');//obj.getAddressLine();
            // Сохраняем укороченный адрес для подписи метки.
            var shortAddress = [obj.getThoroughfare(), obj.getPremiseNumber(), obj.getPremise()].join(' ');
            // Убираем контролы с карты.
            mapState.controls = [];
            // Создаём карту.

            createMap(mapState, shortAddress);

            highlightResult(obj);
            // Выводим сообщение под картой.
            //showMessage(address);
        }
        function showError(message) {
            $('#deliveryMessage').hide();
            $('#deliveryNotice').text(message);
            $('#deliveryAddress').addClass('input_error');
            $('#deliveryNotice').show();
            // Удаляем карту.
            if (hiddenMap) {
                hiddenMap.destroy();
                hiddenMap = null;
            }
        }
        function createMap(state, caption) {

            // Если карта еще не была создана, то создадим ее и добавим метку с адресом.
            if (!hiddenMap) {

                hiddenMap = new ymaps.Map('hidden_map', state);
                placemark = new ymaps.Placemark(
                        hiddenMap.getCenter(), {
                    iconCaption: caption,
                    balloonContent: caption
                }, {
                    preset: 'islands#redDotIconWithCaption'
                });
                hiddenMap.geoObjects.add(placemark);
                // Добавляем зоны на карту.
                deliveryZones = ymaps.geoQuery(json).addToMap(hiddenMap);

            } else {

                hiddenMap.setCenter(state.center, state.zoom);
                placemark.geometry.setCoordinates(state.center);
                placemark.properties.set({iconCaption: caption, balloonContent: caption});
            }

        }
        
        function highlightResult(obj) {
            // Сохраняем координаты переданного объекта.

            var coords = obj.geometry.getCoordinates(),
                    // Находим полигон, в который входят переданные координаты.
                    polygon = deliveryZones.searchContaining(coords).get(0);

            if (polygon) {
                var address = [obj.getThoroughfare(), obj.getPremiseNumber(), obj.getPremise()].join(' ');
                if (address.trim() === '') {
                    address = obj.getAddressLine();
                }
                delivery_price = polygon.properties.get('price');
                delivery_address = address;
                delivery_coords = obj.geometry.getCoordinates();
                $(".deliveryPriceBlock").text(delivery_price + " руб");
                $("#deliveryPrice").val(delivery_price);
                $("#deliveryCoords").val(delivery_coords);
            } else {
                // Если переданные координаты не попадают в полигон
                $(".deliveryPriceBlock").text("От 500 руб");
                $("#deliveryCoords").val('');
                showError("Вне зоны доставки");
            }


        }
    }
    $(".deliveryConfirm").click(function (e) {
        e.preventDefault();
        var form = $("#deliveryForm");
        $.post("/ajax/saveAddress.php", form.serialize(), function (data) {
            var result = $.parseJSON(data);
            showMessage(result.text);
        });
        return false;
    });
});
function showMessage(message) {
            $('#deliveryNotice').hide();
            $('#deliveryMessage').show();
            $('#deliveryMessage').text(message);
        }